reports/stage4/wrkLogsGet1.txt
Running 50s test @ http://localhost:8080
  1 threads and 20 connections
  Thread calibration: mean lat.: 4.335ms, rate sampling interval: 13ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   415.99ms  674.95ms   2.16s    78.72%
    Req/Sec     1.00k   237.68     2.00k    75.30%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.36ms
 75.000%  516.86ms
 90.000%    1.70s 
 99.000%    1.99s 
 99.900%    2.12s 
 99.990%    2.15s 
 99.999%    2.16s 
100.000%    2.16s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.132     0.000000            1         1.00
       1.084     0.100000         3822         1.11
       4.111     0.200000         7642         1.25
       5.795     0.300000        11471         1.43
       6.507     0.400000        15292         1.67
       7.359     0.500000        19115         2.00
       8.139     0.550000        21022         2.22
      10.215     0.600000        22932         2.50
      85.887     0.650000        24837         2.86
     298.239     0.700000        26750         3.33
     516.863     0.750000        28659         4.00
     933.375     0.775000        29613         4.44
    1229.823     0.800000        30570         5.00
    1429.503     0.825000        31529         5.71
    1549.311     0.850000        32487         6.67
    1613.823     0.875000        33444         8.00
    1655.807     0.887500        33915         8.89
    1703.935     0.900000        34399        10.00
    1743.871     0.912500        34882        11.43
    1774.591     0.925000        35361        13.33
    1807.359     0.937500        35833        16.00
    1821.695     0.943750        36068        17.78
    1835.007     0.950000        36310        20.00
    1848.319     0.956250        36539        22.86
    1860.607     0.962500        36778        26.67
    1883.135     0.968750        37022        32.00
    1897.471     0.971875        37139        35.56
    1912.831     0.975000        37262        40.00
    1925.119     0.978125        37380        45.71
    1939.455     0.981250        37496        53.33
    1953.791     0.984375        37616        64.00
    1963.007     0.985938        37673        71.11
    1970.175     0.987500        37740        80.00
    1978.367     0.989062        37795        91.43
    1993.727     0.990625        37853       106.67
    2004.991     0.992188        37920       128.00
    2012.159     0.992969        37948       142.22
    2019.327     0.993750        37976       160.00
    2027.519     0.994531        38008       182.86
    2033.663     0.995313        38035       213.33
    2046.975     0.996094        38062       256.00
    2055.167     0.996484        38079       284.44
    2060.287     0.996875        38091       320.00
    2068.479     0.997266        38107       365.71
    2078.719     0.997656        38121       426.67
    2094.079     0.998047        38138       512.00
    2099.199     0.998242        38144       568.89
    2103.295     0.998437        38153       640.00
    2111.487     0.998633        38159       731.43
    2115.583     0.998828        38171       853.33
    2117.631     0.999023        38175      1024.00
    2119.679     0.999121        38178      1137.78
    2121.727     0.999219        38183      1280.00
    2123.775     0.999316        38186      1462.86
    2127.871     0.999414        38190      1706.67
    2131.967     0.999512        38192      2048.00
    2134.015     0.999561        38194      2275.56
    2138.111     0.999609        38197      2560.00
    2138.111     0.999658        38197      2925.71
    2140.159     0.999707        38200      3413.33
    2144.255     0.999756        38202      4096.00
    2144.255     0.999780        38202      4551.11
    2148.351     0.999805        38204      5120.00
    2148.351     0.999829        38204      5851.43
    2150.399     0.999854        38205      6826.67
    2152.447     0.999878        38206      8192.00
    2152.447     0.999890        38206      9102.22
    2154.495     0.999902        38207     10240.00
    2154.495     0.999915        38207     11702.86
    2156.543     0.999927        38209     13653.33
    2156.543     0.999939        38209     16384.00
    2156.543     0.999945        38209     18204.44
    2156.543     0.999951        38209     20480.00
    2156.543     0.999957        38209     23405.71
    2156.543     0.999963        38209     27306.67
    2156.543     0.999969        38209     32768.00
    2156.543     0.999973        38209     36408.89
    2158.591     0.999976        38210     40960.00
    2158.591     1.000000        38210          inf
#[Mean    =      415.989, StdDeviation   =      674.951]
#[Max     =     2156.544, Total count    =        38210]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    6.47ms
 75.000%   19.12ms
 90.000%   25.04ms
 99.000%   44.77ms
 99.900%   60.74ms
 99.990%   75.26ms
 99.999%  109.69ms
100.000%  109.69ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.079     0.000000            1         1.00
       0.203     0.100000         3831         1.11
       3.001     0.200000         7642         1.25
       5.139     0.300000        11470         1.43
       5.767     0.400000        15284         1.67
       6.467     0.500000        19113         2.00
       7.191     0.550000        21022         2.22
       9.191     0.600000        22928         2.50
      11.255     0.650000        24837         2.86
      13.071     0.700000        26748         3.33
      19.119     0.750000        28658         4.00
      20.703     0.775000        29618         4.44
      21.631     0.800000        30581         5.00
      22.319     0.825000        31536         5.71
      23.039     0.850000        32497         6.67
      23.855     0.875000        33449         8.00
      24.335     0.887500        33915         8.89
      25.039     0.900000        34393        10.00
      25.871     0.912500        34874        11.43
      27.039     0.925000        35349        13.33
      28.511     0.937500        35826        16.00
      29.375     0.943750        36067        17.78
      30.335     0.950000        36302        20.00
      31.535     0.956250        36539        22.86
      32.735     0.962500        36779        26.67
      34.399     0.968750        37018        32.00
      35.295     0.971875        37137        35.56
      36.319     0.975000        37257        40.00
      37.631     0.978125        37376        45.71
      39.135     0.981250        37495        53.33
      40.959     0.984375        37613        64.00
      41.727     0.985938        37673        71.11
      42.847     0.987500        37734        80.00
      43.903     0.989062        37797        91.43
      45.407     0.990625        37852       106.67
      47.039     0.992188        37912       128.00
      47.807     0.992969        37942       142.22
      48.415     0.993750        37972       160.00
      49.087     0.994531        38004       182.86
      49.791     0.995313        38031       213.33
      51.263     0.996094        38062       256.00
      52.031     0.996484        38076       284.44
      52.639     0.996875        38091       320.00
      53.695     0.997266        38106       365.71
      54.911     0.997656        38122       426.67
      56.607     0.998047        38136       512.00
      56.991     0.998242        38144       568.89
      57.471     0.998437        38151       640.00
      58.207     0.998633        38159       731.43
      59.455     0.998828        38166       853.33
      60.863     0.999023        38173      1024.00
      61.151     0.999121        38177      1137.78
      62.303     0.999219        38181      1280.00
      63.455     0.999316        38184      1462.86
      64.735     0.999414        38188      1706.67
      65.663     0.999512        38192      2048.00
      66.111     0.999561        38194      2275.56
      66.879     0.999609        38196      2560.00
      67.199     0.999658        38197      2925.71
      68.031     0.999707        38199      3413.33
      69.055     0.999756        38201      4096.00
      70.079     0.999780        38202      4551.11
      70.655     0.999805        38203      5120.00
      72.319     0.999829        38204      5851.43
      73.535     0.999854        38205      6826.67
      75.263     0.999878        38206      8192.00
      75.263     0.999890        38206      9102.22
      75.455     0.999902        38207     10240.00
      75.455     0.999915        38207     11702.86
      79.743     0.999927        38208     13653.33
      79.743     0.999939        38208     16384.00
      79.743     0.999945        38208     18204.44
      92.863     0.999951        38209     20480.00
      92.863     0.999957        38209     23405.71
      92.863     0.999963        38209     27306.67
      92.863     0.999969        38209     32768.00
      92.863     0.999973        38209     36408.89
     109.695     0.999976        38210     40960.00
     109.695     1.000000        38210          inf
#[Mean    =       11.006, StdDeviation   =       10.457]
#[Max     =      109.632, Total count    =        38210]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  48267 requests in 50.00s, 3.66MB read
  Non-2xx or 3xx responses: 9027
Requests/sec:    965.33
Transfer/sec:     74.95KB