reports/stage4/wrkLogsPut1.txt
Running 50s test @ http://localhost:8080
  2 threads and 20 connections
  Thread calibration: mean lat.: 1.286ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.242ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.31ms  584.32us  16.25ms   80.18%
    Req/Sec   527.77    109.46     1.30k    65.17%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.25ms
 75.000%    1.59ms
 90.000%    1.91ms
 99.000%    2.46ms
 99.900%    8.64ms
 99.990%   15.00ms
 99.999%   16.25ms
100.000%   16.25ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.149     0.000000            1         1.00
       0.736     0.100000         4002         1.11
       0.888     0.200000         8000         1.25
       1.012     0.300000        12013         1.43
       1.130     0.400000        15990         1.67
       1.253     0.500000        19995         2.00
       1.317     0.550000        21996         2.22
       1.380     0.600000        23991         2.50
       1.447     0.650000        25988         2.86
       1.518     0.700000        27976         3.33
       1.589     0.750000        29962         4.00
       1.632     0.775000        30979         4.44
       1.677     0.800000        31974         5.00
       1.726     0.825000        32959         5.71
       1.779     0.850000        33968         6.67
       1.838     0.875000        34965         8.00
       1.874     0.887500        35463         8.89
       1.909     0.900000        35957        10.00
       1.951     0.912500        36456        11.43
       1.994     0.925000        36958        13.33
       2.046     0.937500        37452        16.00
       2.077     0.943750        37714        17.78
       2.109     0.950000        37959        20.00
       2.141     0.956250        38219        22.86
       2.183     0.962500        38459        26.67
       2.223     0.968750        38704        32.00
       2.245     0.971875        38834        35.56
       2.269     0.975000        38956        40.00
       2.297     0.978125        39084        45.71
       2.331     0.981250        39200        53.33
       2.373     0.984375        39324        64.00
       2.395     0.985938        39388        71.11
       2.415     0.987500        39454        80.00
       2.441     0.989062        39514        91.43
       2.469     0.990625        39577       106.67
       2.511     0.992188        39638       128.00
       2.529     0.992969        39669       142.22
       2.557     0.993750        39701       160.00
       2.605     0.994531        39730       182.86
       2.643     0.995313        39761       213.33
       2.685     0.996094        39793       256.00
       2.711     0.996484        39810       284.44
       2.741     0.996875        39824       320.00
       2.873     0.997266        39839       365.71
       3.631     0.997656        39855       426.67
       4.351     0.998047        39870       512.00
       4.679     0.998242        39878       568.89
       5.127     0.998437        39886       640.00
       6.163     0.998633        39894       731.43
       8.011     0.998828        39902       853.33
       8.735     0.999023        39909      1024.00
       9.015     0.999121        39913      1137.78
       9.303     0.999219        39917      1280.00
       9.927     0.999316        39921      1462.86
      10.687     0.999414        39925      1706.67
      11.015     0.999512        39929      2048.00
      11.159     0.999561        39931      2275.56
      13.263     0.999609        39933      2560.00
      13.727     0.999658        39935      2925.71
      13.759     0.999707        39937      3413.33
      13.967     0.999756        39939      4096.00
      14.055     0.999780        39940      4551.11
      14.215     0.999805        39941      5120.00
      14.415     0.999829        39942      5851.43
      14.695     0.999854        39943      6826.67
      14.999     0.999878        39944      8192.00
      14.999     0.999890        39944      9102.22
      15.255     0.999902        39945     10240.00
      15.255     0.999915        39945     11702.86
      15.287     0.999927        39946     13653.33
      15.287     0.999939        39946     16384.00
      15.287     0.999945        39946     18204.44
      15.679     0.999951        39947     20480.00
      15.679     0.999957        39947     23405.71
      15.679     0.999963        39947     27306.67
      15.679     0.999969        39947     32768.00
      15.679     0.999973        39947     36408.89
      16.255     0.999976        39948     40960.00
      16.255     1.000000        39948          inf
#[Mean    =        1.306, StdDeviation   =        0.584]
#[Max     =       16.248, Total count    =        39948]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  49986 requests in 50.00s, 3.96MB read
Requests/sec:    999.70
Transfer/sec:     81.03KB